## Homework 1:

### import pandas as pd

data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Age': [25, 30, 35, 40], 'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']} df = pd.DataFrame(data)

### Rename column names using function. "First Name" --> "first_name", "Age" --> "age
### Print the first 3 rows of the DataFrame
### Find the mean age of the individuals
### Select and print only the 'Name' and 'City' columns
### Add a new column 'Salary' with random salary values
### Display summary statistics of the DataFrame

In [1]:
import pandas as pd

data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Age': [25, 30, 35, 40], 'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']} 
df = pd.DataFrame(data)

df

  First Name  Age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [3]:
new_cols = {
    "First Name":"f_name",
    "Age":"age",
    "City":"hometown",
}

In [ ]:
new_col = df.rename(columns=new_cols)
new_col

    f_name  age       hometown
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   40        Chicago

In [14]:
df['First Name'][:3]

0      Alice
1        Bob
2    Charlie
Name: First Name, dtype: object

In [15]:
df.Age.mean()

32.5

In [16]:
df[["First Name", "Age"]]

  First Name  Age
0      Alice   25
1        Bob   30
2    Charlie   35
3      David   40

In [17]:
df["Salary"] = [2200, 2500, 3100, 4240]

df

  First Name  Age           City  Salary
0      Alice   25       New York    2200
1        Bob   30  San Francisco    2500
2    Charlie   35    Los Angeles    3100
3      David   40        Chicago    4240

In [18]:
import numpy as np

df["Numbers"] = np.random.randn(len(df))

df

  First Name  Age           City  Salary   Numbers
0      Alice   25       New York    2200  0.978516
1        Bob   30  San Francisco    2500  1.245085
2    Charlie   35    Los Angeles    3100  0.530627
3      David   40        Chicago    4240 -0.252469

In [19]:
df.describe()

             Age       Salary   Numbers
count   4.000000     4.000000  4.000000
mean   32.500000  3010.000000  0.625440
std     6.454972   901.332347  0.655321
min    25.000000  2200.000000 -0.252469
25%    28.750000  2425.000000  0.334853
50%    32.500000  2800.000000  0.754571
75%    36.250000  3385.000000  1.045158
max    40.000000  4240.000000  1.245085

## Homework 2:

### Create a DataFrame named sales_and_expenses with columns 'Month', 'Sales', and 'Expenses', representing monthly sales and expenses data. Use below table.
Month	Sales	Expenses
Jan	5000	3000
Feb	6000	3500
Mar	7500	4000
Apr	8000	4500
### Calculate and display the maximum sales and expenses.
### Calculate and display the minimum sales and expenses.
### Calculate and display the average sales and expenses.

In [20]:
sales_and_expenses = {"Month": ["Jan", "Feb", "Mar", "Apr"],
                      "Sales": [5000, 6000, 7500, 8000],
                      "Expenses": [3000, 3500, 4000, 4500]
                      }

df = pd.DataFrame(sales_and_expenses)

df

  Month  Sales  Expenses
0   Jan   5000      3000
1   Feb   6000      3500
2   Mar   7500      4000
3   Apr   8000      4500

In [22]:
max_sales = df.Sales.max()
max_sales

8000

In [23]:
max_expenses = df.Expenses.max()
max_expenses

4500

In [24]:
min_sales = df.Sales.min()
min_sales

5000

In [25]:
min_expenses = df.Expenses.min()
min_expenses

3000

In [26]:
avg_sales = df.Sales.mean()
avg_sales

6625.0

In [27]:
avg_expenses = df.Expenses.mean()
avg_expenses

3750.0

## Homework 3:

### Create a DataFrame named expenses with columns 'Category', 'January', 'February', 'March', and 'April', representing monthly expenses for different categories. Use below table.

Category	January	February	March	April
Rent	1200	1300	1400	1500
Utilities	200	220	240	250
Groceries	300	320	330	350
Entertainment	150	160	170	180

### Calculate and display the maximum expense for each category.
### Calculate and display the minimum expense for each category.
### Calculate and display the average expense for each category.

In this task, use .set_index method to make Category column as index.

Try this code, learn it and use it in the task.

expenses.set_index('Category')

In [28]:
expenses = {
    "Category": ["Rent", "Utilities", "Groceries", "Entertainment"],
    "January": [1200, 200, 300, 150],
    "February": [1300, 220, 320, 160],
    "March": [1400, 240, 330, 170],
    "April": [1500, 250, 350, 180]
}

df = pd.DataFrame(expenses)
df

        Category  January  February  March  April
0           Rent     1200      1300   1400   1500
1      Utilities      200       220    240    250
2      Groceries      300       320    330    350
3  Entertainment      150       160    170    180

In [44]:
expense = df.set_index("Category")

In [46]:
max_expense = expense.max(axis=1)
min_expense = expense.min(axis=1)
avg_expense = expense.mean(axis=1)

max_expense

Category
Rent             1500
Utilities         250
Groceries         350
Entertainment     180
dtype: int64

In [47]:
min_expense

Category
Rent             1200
Utilities         200
Groceries         300
Entertainment     150
dtype: int64

In [48]:
avg_expense

Category
Rent             1350.0
Utilities         227.5
Groceries         325.0
Entertainment     165.0
dtype: float64